using UnityEngine;
using System.Collections;


//-----------------------------------------------------------------

//  ベースエネミーのクラス

//-----------------------------------------------------------------
public class BaseEnemy : BaseCharacter
{

    [SerializeField]
    private Vector2 target;      //目標（ターゲット）








    //------------------------------------------

    //  初期化

    //------------------------------------------
    void Start()
    {

    }

    //------------------------------------------

    //  更新

    //------------------------------------------
    void Update()
    {
    }
}
